Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS.WallDesignThickness
Represents wall design thickness of pipe.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS.WallNominalThickness
Represents wall nominal thickness of pipe.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
Since:
2015